tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Development kit for the Java programming language
brew "openjdk@17"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Node version management
brew "n"
# Highly capable, feature-rich programming language
brew "perl"
# Object-relational database system
brew "postgresql@15"
# Terminal multiplexer
brew "tmux"
# Application launcher and productivity software
cask "alfred"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Tools for the Android SDK
cask "android-sdk"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Git client focusing on productivity
cask "gitkraken"
# Markdown editor
cask "inkdrop"
# Collaboration platform for API development
cask "postman"
# Open-source code editor
cask "visual-studio-code"
mas "BetterSnapTool", id: 417375580
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MKPlayer", id: 1335612105
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
